#include <iostream>
using namespace std;

int a[100];
int n;

int main()
{
	setlocale(LC_ALL, "ru");
	cout << "Введите N: ";
	cin >> n;

  
  
  
  
  
  //Задача №1 - cout << "Нахождение максимального элемента массива";
	for (int i = 1; i <= n; i++)
	{
		a[i] = rand() % 100-50;
		cout << a[i] << " ";
	}
	int max = a[1];
	for (int i = 2; i <= n; i++)  
	{
		if (a[i] > a[max])
		{
			max = i;
		}
	}
	cout << "\n";
	cout << "Удаление " << max << "-го (максимального) элемента массива:" << "\n";
	for (int i = max; i <= n; i++)
	{
		a[i] = a[i + 1];
	}
	for (int i = 1; i <= n-1; i++)
	{
		cout << a[i] << " ";
	}
	cout << "\n" << "\n";




// Задача №2
  int add=0;
	cout << "Введите кол-во элементов, которое нужно добавить: " << "\n";
  cin >> add;
  int k=0;
	cout << "Введите номер, с которого надо начинать добавлять: ";
	cin >> k;
  int m = n+add;
	for (int i = k; i <= m; i++)
{
  a[i + n] = a[i];
}
for (int i = k; i <= n + k-1; i++)
{
  a[i] = rand() % 100-50;
}
n=m; //Увеличение объёма массива для правильной работы следующих программ
for (int i = 1; i <= n; i++)
{
  cout << a[i] << " ";
}
cout << "\n" << "\n";

cout << "По завершению задачи №2:" << "\n";
cout << "Глоб. перем. m (длина массива n+add)=" << m << "\n";
cout << "Глоб. перем. n (длина массива n+add)=" << n << "\n";
cout << "Глоб. перем. add (кол-во добавленных элементов)=" << add << "\n";
cout << "Глоб. перем. k (номер элемента, с которого добавляли)=" << k << "\n" << "\n";


//Задача №4 - Элемент с заданным ключом (значением)
	int f = 0, s = 0, count = 0;
	cout << "Значение элемента, которого необходимо найти (f): ";
	cin >> f;
	for (int i = 1; i <= n; i++)
	{
		count++;
		if (a[i] == f)
		{
			s = i;
			break;
		}
	}
	if (s == 0) cout << "Не найдено элементов с заданным значением f";
	else
	{
		cout << "Элемент найден" << "\n";
		cout << "Количество сравнений, проведенных в ходе поиска: " << count;
	}
	cout << "\n" << "\n";

//Задача №5 - сортировка простым обменом
int sort = 0;
	for (int i = 1; i <= n; i++)
	{
		for (int j = 1; j <= n-1; j++)
		{
			if (a[j] > a[j + 1])
			{
				sort = a[j];
				a[j] = a[j + 1];
				a[j + 1] = sort;
			}
		}
  }
	cout << "Массив, отсортированный методом простого обмена:" << "\n";
	for (int i = 1; i <= n; i++)
	{
		cout << a[i] << " ";
	}
}
